In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import tensorflow as tf
from sklearn.preprocessing import LabelEncoder
from sklearn.impute import SimpleImputer

In [3]:
titanic_df = pd.read_csv('titanic/train.csv')
titanic_test_df = pd.read_csv('titanic/test.csv')

In [4]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
titanic_test_df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [6]:
useless_cols = ['PassengerId', 'Name', 'Ticket']
titanic_df = titanic_df.drop(columns=useless_cols, axis=1)

In [7]:
titanic_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [8]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.7+ KB

In [9]:
titanic_test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [10]:
len(titanic_df[~titanic_df.Age.isnull()])

714

In [11]:
titanic_df.Parch.value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [12]:
titanic_df.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [13]:
titanic_df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [14]:
titanic_df[(titanic_df.Age.isnull()) & (titanic_df.Parch>1)]

     Survived  Pclass     Sex  Age  SibSp  Parch     Fare Cabin Embarked
140         0       3  female  NaN      0      2  15.2458   NaN        C
159         0       3    male  NaN      8      2  69.5500   NaN        S
180         0       3  female  NaN      8      2  69.5500   NaN        S
201         0       3    male  NaN      8      2  69.5500   NaN        S
324         0       3    male  NaN      8      2  69.5500   NaN        S
533         1       3  female  NaN      0      2  22.3583   NaN        C
593         0       3  female  NaN      0      2   7.7500   NaN        Q
783         0       3    male  NaN      1      2  23.4500   NaN        S
792         0       3  female  NaN      8      2  69.5500   NaN        S
846         0       3    male  NaN      8      2  69.5500   NaN        S
863         0       3  female  NaN      8      2  69.5500   NaN        S
888         0       3  female  NaN      1      2  23.4500   NaN        S

In [18]:
default_embarked = titanic_df.Embarked.mode()[0]
default_age = titanic_df.Age.mode()[0]
default_cabin = titanic_df.Cabin.mode()[0]
titanic_df['Age_filled'] = titanic_df.groupby(['Sex', 'Pclass','Parch'])['Age']\
.transform(lambda x: x.fillna(x.median()))

def fill_age(df, feature_columns, target_column):
    filled_col_name = target_column + '_filled'
    df[filled_col_name] = df.groupby(feature_columns)[target_column]\
        .transform(lambda x: x.fillna(np.nan if pd.isnull(x.median()) else x.median()))
    while True:
        if df[filled_col_name].isnull().any():
            if len(feature_columns) > 1:
                del feature_columns[-1]
                df[filled_col_name] = df.groupby(feature_columns)[filled_col_name]\
        .transform(lambda x: x.fillna(np.nan if pd.isnull(x.median()) else x.median()))
            else:
                df[filled_col_name] = df[filled_col_name].fillna(df[target_column].median(dropna=True))
        else:
            break
    return df

True

In [114]:
#encoder_embarked = LabelEncoder()
#encoder_embarked.fit(titanic_df['Embarked'].fillna('NULL'))
#titanic_df['Embarked_filled'] = titanic_df['Embarked'].map(lambda x: x if pd.isnull(x) else encoder_embarked.transform([x])[0])
titanic_df['Embarked_filled'] = titanic_df.groupby(['Sex', 'Pclass','Parch','SibSp'])['Embarked']\
.transform(lambda x: x.fillna( titanic_df.Embarked.mode()[0] if x.count()<=0 else x.mode()[0]))

In [115]:
titanic_df.info()
titanic_df.Embarked.mode()[0]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
Survived           891 non-null int64
Pclass             891 non-null int64
Sex                891 non-null object
Age                714 non-null float64
SibSp              891 non-null int64
Parch              891 non-null int64
Fare               891 non-null float64
Cabin              204 non-null object
Embarked           889 non-null object
Age_filled         891 non-null float64
Embarked_filled    891 non-null object
Cabin_filled       891 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.6+ KB

'S'

In [140]:
titanic_df['Cabin_filled'] = titanic_df.groupby(['Sex', 'Pclass','Parch','SibSp','Fare'])['Cabin']\
.transform(lambda x: x.fillna(np.nan if x.count()<=0 else x.mode()[0]))
titanic_df['Cabin_filled'] = titanic_df.groupby(['Sex', 'Pclass','Parch','SibSp'])['Cabin']\
.transform(lambda x: x.fillna(np.nan if x.count()<=0 else x.mode()[0]))
titanic_df['Cabin_filled'] = titanic_df.groupby(['Sex', 'Pclass','Parch'])['Cabin']\
.transform(lambda x: x.fillna(np.nan if x.count()<=0 else x.mode()[0]))
titanic_df['Cabin_filled'] = titanic_df.groupby(['Sex', 'Pclass'])['Cabin']\
.transform(lambda x: x.fillna(np.nan if x.count()<=0 else x.mode()[0]))

In [141]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
Survived           891 non-null int64
Pclass             891 non-null int64
Sex                891 non-null object
Age                714 non-null float64
SibSp              891 non-null int64
Parch              891 non-null int64
Fare               891 non-null float64
Cabin              204 non-null object
Embarked           889 non-null object
Age_filled         891 non-null float64
Embarked_filled    891 non-null object
Cabin_filled       891 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.6+ KB

In [142]:
titanic_cleaned_df = titanic_df.drop(columns=['Age','Cabin','Embarked'], axis=1)

In [143]:
titanic_cleaned_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived           891 non-null int64
Pclass             891 non-null int64
Sex                891 non-null object
SibSp              891 non-null int64
Parch              891 non-null int64
Fare               891 non-null float64
Age_filled         891 non-null float64
Embarked_filled    891 non-null object
Cabin_filled       891 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.7+ KB

In [144]:
titanic_target = titanic_cleaned_df[['Survived']]
titanic_data = titanic_cleaned_df.drop(columns=['Survived'],axis=1)

In [145]:
titanic_data.head()

   Pclass     Sex  SibSp  ...  Age_filled  Embarked_filled  Cabin_filled
0       3    male      1  ...        22.0                S         F G73
1       1  female      1  ...        38.0                C           C85
2       3  female      0  ...        26.0                S            G6
3       1  female      1  ...        35.0                S          C123
4       3    male      0  ...        35.0                S         F G73

[5 rows x 8 columns]